app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts"
---
	def index
		if params[:author_id]
			@posts = Author.find(params[:author_id]).posts
		else
			@posts = Post.all